In [1]:
# 타이타닉 데이터
import seaborn as sns

titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
titanic["age"].fillna(titanic["age"].mean(), inplace=True)

In [40]:
y = titanic["survived"]
x = titanic[["pclass","age", "fare"]]

# 훈련, 테스트로 나누기
from sklearn.model_selection import train_test_split
x_tr, x_te, y_tr, y_te = train_test_split(x,y,random_state=20220411,stratify=y)
print(x_tr.iloc[:5,:])
print(y_tr[:5])

     pclass        age     fare
501       3  21.000000   7.7500
837       3  29.699118   8.0500
43        2   3.000000  41.5792
198       3  29.699118   7.7500
877       3  19.000000   7.8958
501    0
837    0
43     1
198    1
877    0
Name: survived, dtype: int64

In [41]:
from sklearn.neighbors import KNeighborsClassifier

model = KNeighborsClassifier(n_neighbors=3)
model.fit(x_tr, y_tr)

KNeighborsClassifier(n_neighbors=3)

In [42]:
#여러개를 한꺼번에 에측
pred = model.predict(x_te)

In [43]:
# 답
y_te

508    0
14     0
830    1
222    0
669    1
      ..
207    1
399    1
677    1
121    0
750    1
Name: survived, Length: 223, dtype: int64

In [44]:
#정답률
sum(pred==y_te)/len(pred)

0.6457399103139013

In [56]:
# 정답률 함수
model.score(x_te, y_te)

0.6457399103139013